Revit 2026 API

# TemperatureRatingTypeAddCorrectionFactor Method

---

Add a new electrical correction factor type to this temperature rating type. The given temperature value should be quantified in the document's selected unit of electrical temperature.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CorrectionFactor AddCorrectionFactor(
	double temperature,
	double factor
)
```
```vb
Public Function AddCorrectionFactor (
	temperature As Double,
	factor As Double
) As CorrectionFactor
```
```cpp
public:
CorrectionFactor^ AddCorrectionFactor(
	double temperature,
	double factor
)
```
```fsharp
member AddCorrectionFactor :
        temperature : float *
        factor : float -> CorrectionFactor
```

#### Parameters

temperature Double
    Temperature of correction factor to be added in the document's selected unit of electrical temperature.
factor Double
    Factor of correction factor to be added.

#### Return Value

CorrectionFactorNew constructed correction factor.

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace